application/app/Http/Controllers/Setup/Setup.php

    public function updateSettings() {

        //validate
        $validator = Validator::make(request()->all(), [
            'settings_company_name' => 'required',
            'settings_system_timezone' => 'required',
        ]);

        //errors
        if ($validator->fails()) {
            abort(409, __('Fill in al required fields'));
        }

        //import sql file
        $sql_file = BASE_DIR . '/setup.sql';

        //validate file
        if (!is_file($sql_file)) {
            abort(409, __('Error(1004): A required file (/setup.sql) is missing'));
        }

        //import the file
        DB::unprepared(file_get_contents($sql_file));

        //update default settings
        if (!$settings = \App\Models\Settings::Where('settings_id', 1)->first()) {
            abort(409, __('Error(1007): Unable to load database settings'));
        }

        //update default categories dates
        \App\Models\Category::where('category_system_default', 'yes')
            ->update(['category_created' => now()]);

        //update default categories dates
        \App\Models\KbCategories::where('kbcategory_system_default', 'yes')
            ->update(['kbcategory_created' => now()]);
---
select * from `settings` where `settings_id` = 1 limit 1
update `categories` set `category_created` = '2021-01-19 12:15:18', `categories`.`category_updated` = '2021-01-19 12:15:18' where `category_system_default` = 'yes'
update `kb_categories` set `kbcategory_created` = '2021-01-19 12:15:18', `kb_categories`.`kbcategory_updated` = '2021-01-19 12:15:18' where `kbcategory_system_default` = 'yes'

        //update settings
        $settings->settings_company_name = request('settings_company_name');
        $settings->settings_installation_date = now();
        $settings->save();
---
update `settings` set `settings_installation_date` = '2021-01-19 12:15:18', `settings_company_name` = 'CYH', `settings`.`settings_updated` = '2021-01-19 12:15:18' where `settings_id` = '1'

    public function updateUser(EnvRepository $envrepo) {

        //validate
        $validator = Validator::make(request()->all(), [
            'first_name' => 'required',
            'last_name' => 'required',
            'email' => 'required',
            'password' => 'required',
        ]);

        //errors
        if ($validator->fails()) {
            abort(409, __('Fill in al required fields'));
        }

        //update default user
        if (!$user = \App\Models\User::Where('id', 1)->first()) {
            abort(409, __('Error(1005): Admin user could not be updated'));
        }
        $user->first_name = request('first_name');
        $user->last_name = request('last_name');
        $user->email = request('email');
        $user->password = bcrypt(request('password'));
        $user->created = now();
        $user->updated = now();
        $user->last_seen = now();
        $user->creatorid = 0;

        $user->save();
---
select * from `users` where `id` = 1 limit 1
update `users` set `created` = '2021-01-19 12:19:13', `creatorid` = 0, `email` = 'jonathan@simplehost.sg', `password` = 'y$Ly0nv4um4wxW1fsf49Vt.uXznlBTUWfXnnY/2hOgMJy2l7Gf3UGOy', `first_name` = 'Johnathan', `last_name` = 'Tan', `last_seen` = '2021-01-19 12:19:13', `users`.`updated` = '2021-01-19 12:19:13' where `id` = '1'